### Dataframe is a 2D representation

In [1]:
import pandas as pd

In [2]:
data={"Name":['spongebob','patrick','squidward'],
      "Age":[30,35,49],
      }

In [3]:
df=pd.DataFrame(data)
df

        Name  Age
0  spongebob   30
1    patrick   35
2  squidward   49

In [4]:
df=pd.DataFrame(data, index=["employee1","employee2","employee3"])

In [5]:
df

                Name  Age
employee1  spongebob   30
employee2    patrick   35
employee3  squidward   49

In [6]:
df.loc["employee1"]

Name    spongebob
Age            30
Name: employee1, dtype: object

In [7]:
df.iloc[0]

Name    spongebob
Age            30
Name: employee1, dtype: object

* adding a new column

In [8]:
df["job"]=['cook','N/A','cashier']
df

                Name  Age      job
employee1  spongebob   30     cook
employee2    patrick   35      N/A
employee3  squidward   49  cashier

* adding a new row

In [9]:
new_row=pd.DataFrame([{"Name":"sandy", "Age":23,"job":"nothing"}],index=["employee4"])

In [10]:
df=pd.concat([df,new_row])

In [11]:
df

                Name  Age      job
employee1  spongebob   30     cook
employee2    patrick   35      N/A
employee3  squidward   49  cashier
employee4      sandy   23  nothing